{
  "education": [
    {
      "awards_achievements": [
        "GPA(3.5)"
      ],
      "degree": "Post Graduate Certificate - Information Technology and Business Analysis",
      "department": "Information and Technology",
      "duration": "2021-2022",
      "school_name": "Conestoga College"
    },
    {
      "awards_achievements": [
        "GPA(3.1)"
      ],
      "degree": "Bachelors in computer Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2011-2015",
      "school_name": "Tribhuvan University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_TirupatiShiwakoti",
  "highlighted_projects": [
    {
      "description": "WP Travel is a free powerful travel engine built on WordPress. My responsibility for the product was to perform the quality analysis and prepare final documentation of the plugin. I worked as the customer support engineer for this product and was responsible for the decision to make the product live after complete testing. I assisted the sales team in marketing as well.",
      "name": "WP Travel (WordPress Plugin)"
    },
    {
      "description": "Web application related to agriculture along with the SMS feature. Programming language used were PHP, CSS, JavaScript and Android. My part was to determine functional requirements and high-level features for the project. I performed the quality analysis. I also gather analytics, manage budgets, and work as project manager.",
      "git_url": null,
      "name": "I-Agri - Web based Agricultural Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Primary scripts were developed using the bash scripting language. It uses the bash script to create the docker container to set up a Postgress SQL instance. Two bash scripts, host_info.sh, collect the hardware information and host_usage.sh collects the data regarding the memory and CPU usage and monitors resource usage every minute using crontab. These scripts were used to add the data into the database using the ddl.sql file.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "Performed data analysis on transaction data submitted by LGS to assist the marketing team in finding the answers to commercial queries so that the company's income may be increased utilising RFM report. Python was utilised for the study together with libraries like pandas, numPy, scipy, and seaborn in a Jupyter notebook. The company's data warehouse, Postgres, was operated via a docker container.",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    }
  ],
  "name": "Tirupati Shiwakoti",
  "others": [
    {
      "bullets": [
        "Lite Technical Exhibition 2015"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Taekwondo Competitor; Participated in regional level",
        "Volunteer; Little Sisters Fund: Conducted workshops reaching over 100 girls.",
        "Volunteer; Amnesty International Nepal: Served as a volunteer for several programs held by Amnesty International in Kathmandu"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Finished projects with a team using Agile/Scrum methodology, utilising tools and technologies including Linux, SQL, and Docker. I oversaw several daily scrum meetings where I assisted in setting the team's objectives and removing obstacles.",
      "duration": "2022-present",
      "title": "BSA"
    },
    {
      "company": "Way Of Wills",
      "description": "Worked as a QA and was responsible for assisting the supervisor on performing the quality check of the product. I was a request handler, responding to requests from other production team members. I also work as an assistant, assisting the supervisor in analyzing the final product ready for shipment.",
      "duration": "2021",
      "title": "Production Assistant (Part-time, Contractual)"
    },
    {
      "company": "WEN Solutions Pvt. Ltd",
      "description": "I was a support lead where I resolved the customer queries related to the product. Communicated with business clients, understood their needs, and offered solutions. I reviewed the themes that are to be made live on wordpress.org. Perform the technical analysis on the Theme and report the error to the developer. My responsibility includes the quality testing of the product (Theme/Plugins). I was also involved in decision amking process of making the product live after complete testing. Initially, I worked as a PHP developer where I would perform code customization as per client requests. Documentation, make the documentation of the Product and review the documentation of the Product.",
      "duration": "2016-2022",
      "title": "Customer Support Engineer and Quality assurance analyst (Full-time)"
    }
  ],
  "skills": {
    "Business Skills": [
      "Documentation",
      "Requirement Elicitation",
      "Presentation",
      "Visio",
      "Agile/Scrum"
    ],
    "Technical Skills": [
      "RDBMS/SQL",
      "Data Modeling/Mapping",
      "Data Analytics",
      "Python",
      "NumPy",
      "Linux/Bash",
      "GitFlow",
      "Docker"
    ]
  },
  "summary": "I graduated with a post-graduate degree in Information Technology and Business Analysis from Conestoga college. I have 4+ years of experience in the information technology, service, and cosmetic industries. I have worked in customer and client Services, project management, quality analysis, and marketing, including digital marketing. I am proficient in a variety of technical skills such as SQL, Linux, and other languages. I am an enthusiastic learner with a proper understanding of business and information technology. I am currently working as a BSA at Jarvis Consulting Group, where I am developing my skill as a BSA with the use of standard technologies and the use of numerous tools and methodologies for data analysis."
}
